[{"calories":62000,"name":"Aggroll","location":"Frosted Peak","bug":"Hermit Crab","snack":"Egg Rolls","isSelected":false,"strategy":"A single Aggroll can be found trapped in ice in the lower cavern in the side of the Frosted Peak. The Trip Shot must be placed on the Fire Beacon to light it on fire, then fired at the ice to melt it.\n\nOnce free, the Aggroll will patrol around, charging at the player or other Bugsnax if seen. To capture it, use the Snakgrappler to pull the box off, leaving them exposed to either collect with the Snakgrappler or the Bug Net. ","attributes":["Aggressive"]},{"calories":56000,"name":"Baby Cakelegs","location":"Frosted Peak","bug":"Daddy Longlegs","snack":"Cake Slice","isSelected":false,"hasBeenSeen":false,"hasBeenPhotographed":false,"strategy":"In between phases of the Daddy Cakelegs fight, four Baby Cakelegs appear and happily walk in a line towards Daddy Cakelegs' new location. They are incredibly easy to catch by placing a Snak Trap in their path, making it possible to capture the whole swarm with a single trap. ","attributes":["Sweet","Frosty"]},{"calories":10500,"name":"Banopper","location":"Frosted Peak","bug":"Grasshopper","snack":"Banana","isSelected":false,"hasBeenSeen":false,"hasBeenPhotographed":false,"strategy":"Two Banoppers will spawn upon breaking a Scoopy Banoopy. They will then jump into the trees, and begin leaping between them. The Trip Shot can be attached to a distant tree in order to intercept a Banopper, causing it to fall, where it can be captured with the Bug Net.","attributes":["Fruity","Evasive"]},{"name":"Red Banopper","location":"Boiling Bay","bug":"Grasshopper","snack":"Banana","hasBeenSeen":true,"hasBeenPhotographed":false,"isSelected":false,"strategy":"Red Banoppers leap between treetops in Boiling Bay. To catch them the Trip Shot can be attached to a high surface to intercept their path. Once tripped up, Red Banopper will fall to the ground, where it can be picked up with the Bug Net.","calories":"9,000","attributes":["Red","Fruity","Evasive"]},{"name":"Big Bopsicle","location":"Sugarpine Woods","bug":"Atlas Beetle","snack":"Popsicle","isSelected":false,"strategy":"The Big Bopsicle is an aggressive Bugsnak and will attack when the player gets too close to it. Furthermore, it also will freeze any attacker. Big Bopsicles can only be caught complete in two steps - first - the Bopsicle must lose its power to freeze. This can be done in leading it into warm water or near fire. Second step - movement of the Big Bopsicle must be stopped. The Buggy Ball can be used to lure the Bopsicle, the Trip Shot is useful to stop the Bopsicle. Once it's lost its power to freeze, it soon starts to break up into two Bopsicles. It's necessary to be quick with the net to catch it while it is stunned. You can also catch it by lighting the Tripshot on fire and luring the Bopsicle towards it","calories":"8,200","attributes":["Sweet","Aggressive","Frosty","Breakable"]},{"name":"Bombino","location":"Sizzlin' Sands","bug":"Case-Bearing Caterpillar","snack":"Pizza Pocket","isSelected":false,"strategy":"Bombinos first appear when initiating the battle against Mothza Supreme. When Cromdo activates the Incherrito statue, ancient stone pizza cutters will arise from the sand, and using the Snakgrappler on one will cause it to destroy a sarcophagus, revealing a Bombino inside. When this Bombino is thrown onto the stone pedestal, it will explode, breaking the stone, while also becoming easily vulnerable to capture.\n\nWhen returning to this area after Mothza Supreme is defeated, Bombinos will be present, but will now be on fire, requiring them to be extinguished before capture.","calories":"3,666","attributes":["Meaty","Aggressive","Spicy"]},{"name":"Bopsicle","location":"Sugarpine Woods","bug":"Atlas Beetle","snack":"Popsicle","isSelected":false,"strategy":"Bopsicles only appear once a Big Bopsicle is broken, by exposing it either to water or fire. The Big Bopsicle will split into two dazed Bopsicles, which can be captured with the Bug Net. If not captured in time, the Bopsicles will come to their senses, regain a layer of frost, and behave like a Big Bopsicle.","calories":"4,100","attributes":["Sweet","Aggressive","Frosty"]},{"name":"Bunger","location":"Garden Grove","bug":"Rhinoceros Beetle","snack":"Burger","isSelected":false,"strategy":"Bungers waddle around in circles around the bottom of Garden Grove. They will not actively chase the player, but if the player or another Bugsnak is in their way, they will launch them into the air and display a teasing expression. \n\nThey are not catchable with Snak Trap unless stunned, and will knock them away. To stun them, you need to use ketchup to lure another Bunger into ramming into the Bunger. This will allow the player to pick them up with the Bug Net or Snak Trap. Additionally, it's also possible to use the Trip Shot.","calories":"30","attributes":["Meaty","Aggressive"]},{"name":"BBQ Bunger","location":"Scorched Gorge","bug":"Rhinoceros Beetle","snack":"Burger","isSelected":false,"strategy":"Only one BBQ Bunger spawns in the area at a time. Upon spotting the player, this Bugsnak will diligently chase them down in an attempt to tackle them playfully as suggested by their \"heart eyes\" emote.\n\nIn order to capture the BBQ Bunger, the player can catch its attention, and lure it down to the lower level of the Gorge. Once there, the player can use the Sauce Slinger to coat the Bunger in ketchup, which will get the attention of aggressive Spuddies. Once a Spuddy successfully tackles the Bunger, it will stun it, allowing the player the chance to scoop it up in their Net.\n\nAlternatively, after the player acquires the Trip Shot, it can be used to stun the Bunger without the need to lure it down to other aggressive Snax.","calories":"53,500","attributes":["Meaty","Aggressive"]},{"name":"Bunger Royale","location":"Broken Tooth","bug":"Rhinoceros Beetle","snack":"Multi-Layered Burger + Tater Tots","isSelected":false,"strategy":"In order to capture the Bunger Royale, the player can catch its attention, and lure it down to the lower level of the Isle. Once there, the player can use the Shrink Spice to shrink the Bunger, which will make it diligently chase the player down in an attempt to tackle them playfully as suggested by their \"heart eyes\" emote. Then you have to set up your Trip Shot. Once the Trip Shot successfully stuns the Bunger, the player has a chance to scoop it up in their Bug Net.","calories":"67,700","attributes":["Aggressive","Meaty"]},{"name":"Buffalocust","location":"Sizzlin' Sands","bug":"Locust","snack":"Buffalo Wings","isSelected":false,"strategy":"Buffalocust flies in a looping path, and dives out of the sky at anything that comes close in contact with it. When it sees ranch dressing or hot sauce, it will dive into it and hop on the ground for a short time. This dive can be used to attack other Bugsnax, for example, to break an Eggler's shell, or to destroy fragile ground and reveal secrets.\n#Get it stuck in a Flapjackarak's tornado, which will both knock it down and extinguish its flame. \n#If close enough to the Sodie D at to oasis, the Sodie will spray water to extinguish it, also bringing it to the ground. When it falls to the ground, use the Bug Net to catch it. A method of getting it to follow you is get it mad by launching a sauce to it that it does not like and will follow you untill it can attack. Another method is putting a sauce it likes on Sprout and lure it to the oasis.","calories":"32,500","attributes":["Meaty","Aggressive","Flying","Spicy"]},{"name":"Cappucceetle","location":"The Triplicate Space","bug":"Beetle","snack":"Cappuccino","isSelected":false,"strategy":"Cappucceetle is skittish and flees when it spots the Journalist, and it will leave the current area if allowed to reach the exit. It is the fastest moving snak in the game, and is even able to run across the surface of water. It is immune to the Snak Trap. The Trip-Shot will not stun it, but if it is used to block off the Cappucceetle's escape from the area, it will be rendered unable to leave and be made much easier to catch.\n\nIt will cycle between Flavor Falls, Boiling Bay, Sizzlin' Sands, and Frosted Peak in that order when scared away. It can be found running in the general area where the statues of any defeated Legendary Bugsnax (not counting Cheddaboardle Rex) are located. These areas are Mama Mewon's arena, around the Minimaki spawn area, beside the bottom of the temple where Mothza Supreme is fought, and around the first level of the mountain in Frosted Peak.\n\nTo catch it in Flavor Falls, make a chocolate trail or use the Buggy Ball to lure it over to the path of the Sandopede. If it gets hit, it will be dazed and able to be caught.\n\nTo catch it in Sizzlin' Sands, hit it with Cheese, and wait for a Black Lollive to pick it up, allowing you to net it from the helpful flying bugsnak.\n\nThe second method of catching it in the Sizzlin’ Sands is to wait or sleep until daytime for Flapjackarack to appear, lead it over to Cappucceetle’s path while it’s stirring up a dust devil, preferably cover Flapjackarack in chocolate to get Cappucceetle to run into Flapjackarack, and once Cappucceetle gets swept up and away it’s free for the taking wherever it lands.\n\nA third method is to use the Trip Shot to block the exit, and then lead a Loaded Spuddy over to the Cappucceetle while it is trying to leave. Stand between the two to achieve a collision and pick up the Cappucceetle.\n\nTo catch it in Frosted Peak immediately run up to the campfire past the Scoopy Banoopy and set yourself on fire, then run towards the Scoopy Banoopy and let it hit you, after that you place chocolate on the Scoopy Banoopy as the Cappucceetle runs down the mountain the Scoopy Banoopy will hit the Cappucceetle and it will be able to get captured.\n\nTo catch it in Boiling Bay, summon Megamaki and simply wait for them to eventually collide. A more active method is to use chocolate to stall the Cappucceetle for a little bit from moving by shooting it at a log connecting two sandy areas and scaring it by coming into it's proximity, you can then wait for the Megamaki to path near that area and have the Cappucceetle and Megamaki run into each other.\n\nThe second method in Boiling Bay is to cover the Cappucceetle in chocolate and lure a Green Crapple to pick it up.\n\nAn additional method in Boiling Bay is to place a Cocomite shell near the Cappucceetle's path and set it ablaze, summoning both Cocomites, and then covering one in chocolate so the Cappuceetle will run into it.\n\nOnce the Cappuceetle is caught, another will spawn in The Triplicate Space. Once woken up and allowed to flee, it will begin running around in the other areas again.","calories":"13,000","attributes":["Evasive"]},{"name":"Cellystix","location":"Broken Tooth","bug":"Stickbug","snack":"Celery Stick","isSelected":false,"strategy":"When Cellystix is first encountered, it has three small Chocolant in the peanut butter on its back. In this state, Cellystix is passive, and slowly walks around. Cellystix will become aggressive if any small Chocolants are on the ground nearby, and will be once again pacified once they have jumped back onto its back. To catch Cellystix, it must first be shrunk, which will cause any Chocolants on its back to jump off and grow. If passive, Cellystix can be easily caught in a Snak Trap, but if aggressive, it can be stunned using the Trip Shot, and caught with the Bug Net.","calories":"19,000","attributes":["Aggressive","Green"]},{"name":"Charmallow","location":"Sugarpine Woods","bug":"Firefly","snack":"S'mores","isSelected":false,"strategy":"As Charmallow is constantly on fire, it must be extinguished in order to catch it. This can be done by having it come into contact with a Big Bopsicle or Bopsicle, either by launching the Bopsicle into Charmallow with the Lunchpad, or by luring the Charmallow by covering the Bopsicle with chocolate or peanut butter. The Trip Shot can also be used to make Charmallow fall into the water. Once extinguished, Charmallow can be caught in the Bug Net.","calories":"26,800","attributes":["Sweet","Flying","Spicy"]},{"name":"Cheddaboardle Rex","location":"Broken Tooth","bug":"Dung Beetle","snack":"Cheese Board","isSelected":false,"strategy":"When Cheddaboardle Rex is summoned, it will pick up the Buggy Ball and throw it high into the stratosphere, preventing its use for most of the battle. Cheddorb will roll into the arena from above, and the boss will throw these as projectiles.\n\nFor the first phase, the Ancient Lunchpad must be used to fight Cheddaboardle. First, the Snakgrappler must be used to clear the boulders blocking the pads, and the boss can then be baited into throwing Cheddorbs into them. Once locked in, the Snakgrappler can be used to launch the Cheddorb directly at Cheddaboardle's lid, damaging it. After each hit, Cheddaboardle will destroy the Lunchpad used, and after two hits, the next phase will begin.\n\nThe second phase begins with the appearance of new Ancient Lunchpads, this time covered with piles of rocks. Cheddaboardle will begin throwing rocks as an attack in this phase. Shrink Spice must be use to shrink the Cheddorbs, which will flee into the holes of the rock piles, and destroy them after growing large again. Once this is done, the Lunchpads can be used as normal, and after two more hits, the third phase will begin.\n\nThe third phase begins with the appearance of two ramp launchers on either side of the arena. Cheddaboardle must again be baited into throwing Cheddorbs into these launchers, but unlike the grounded Lunchpads, they will not aim on their own. The Cheddorb should be launched after Cheddaboardle finished throwing rocks, as these rocks will block the shot. After two hits from these launchers, the Buggy Ball will finally return from the sky.\n\nFor the fourth and final phase, a large maze will appear on a wall of the arena. The Buggy Ball must be guided through this maze in order to get to the final launcher, located in its center. All the while, Cheddaboardle will continue its attacks to disrupt the player. Once the Buggy Ball is launched at Cheddaboardle, its lid will shatter, making it vulnerable to Shrink Spice. After being shrunk, Cheddaboardle must be run over with the Big Buggy Ball, and it can then finally be captured in the Bug Net.","calories":"2,132,000","attributes":["Aggressive","Breakable"],"hasBeenSeen":false,"hasBeenPhotographed":false},{"name":"Cheddorb","location":"Broken Tooth","bug":"Giant Ostracod","snack":"Port Wine Cheese Ball","isSelected":false,"strategy":"The journalist can use the Shrink Spice to shrink down the Cheddorb. When it's near the player when shrunk, it will quickly flee to a hiding log. The Buggy Ball can be used to flush it out of a log, and into a Snak Trap on the other side. If no log is nearby, Cheddorb may continue to roll along its regular path, and the Trip Shot can be used to stun it.\n\nCheddorbs also appear during the battle against Cheddaboardle Rex, where they must be used to attack the boss.","calories":"90,000","attributes":["Evasive"]},{"name":"Cheepoof","location":"Scorched Gorge","bug":"Butterfly/Moth","snack":"Cheese Puff & Nacho Chips","isSelected":false,"strategy":"Cheepoof flies around a small area. It can be captured by launching a Snak Trap at it using the Lunchpad, or by tripping it up with the Trip Shot.","calories":"15,000","attributes":["Flying"]},{"name":"White Cheepoof","location":"Scorched Gorge","bug":"Butterfly/Moth","snack":"White Cheddar Cheese Puff & Nacho Chips","isSelected":false,"strategy":"White Cheepoof flies around a small area. It can be captured by launching a Snak Trap at it using the Lunchpad, or by tripping it up with the Trip Shot.","calories":"16,000","attributes":["Flying"]},{"name":"Flamin' Cheepoof","location":"Boiling Bay","bug":"Butterfly/Moth","snack":"Spicy Cheese Puff & Nacho Chips","isSelected":false,"hasBeenSeen":true,"hasBeenPhotographed":true,"strategy":"Flamin' Cheepoof appears in the lava cave in Boiling Bay, alongside Noodlers. To catch it, the Trip Shot can be used to knock it out of the air, and it can then be extinguished by a nearby Paletoss Grande. Alternatively, a La Sodieux lured into the cave will readily extinguish any spicy snak nearby, and a doused Cheepoof will fall to the ground, ready to be collected with the Bug Net. Or alternativly you can launch a Paletoss Grande at the Flamin' Cheepoof, which will give you the said bugsnax, plus 2 Paletoss.","calories":"16,000","attributes":["Red","Flying","Spicy"]},{"name":"Cheery","location":"Frosted Peak","bug":"Ice Flea","snack":"Cherry","isSelected":false,"strategy":"Cheery can only be captured after breaking a Scoopy Banoopy, which will cause one Cheery to appear. After it appears, Cheery is very simple to catch, similar to Strabby, and can be caught with essentially any method.","calories":"7,700","attributes":["Red","Fruity"]},{"name":"Cheezer","location":"Sizzlin' Sands","bug":"Huntsman Spider","snack":"Cheese Sandwich Cracker","isSelected":false,"strategy":"Cheezer runs quickly around a set path, and is too fast to be caught in the Snak Trap. The Trip Shot must be placed in its path to stun it, which is possible as it runs between stone columns. If a Snak Trap is covered in cheese, Cheezer will run into it and bounce off, creating a very brief opportunity to catch it in the trap. It's also possible to catch it by covering it with sauce to get an aggressive snak to stun it. ","calories":"3,300","attributes":["Evasive"]},{"name":"Chillynilly","location":"Frosted Peak","bug":"Firefly","snack":"Ice Cream Sandwich","isSelected":false,"strategy":"Chillynilly appears in Frosted Peak at night, flying around the area. It can be knocked down with the Trip Shot, but its frost will have to be melted by a Stewdler in order to capture it. Alternatively, if the Trip Shot is on fire, Chillynilly will be thawed on contact, making it safe to catch in the Bug Net. You can also catch it by luring onto a Stewdler with Chocolate.","calories":"16,600","attributes":["Sweet","Flying","Frosty"]},{"name":"Chippie","location":"Frosted Peak","bug":"Huntsman Spider","snack":"Chocolate Chip Cookie","isSelected":false,"strategy":"Chippie runs around the mountain, passing through the top cave where Stewdler and Chillynilly can be found. It is too fast to be trapped, but can be stunned by setting up the Trip Shot across one of the cave entrances.\n\nIf a Snak Trap is covered in peanut butter, Chippie will run into it and bounce off, creating a very brief opportunity to catch it in the trap.","calories":"7,800","attributes":["Sweet","Evasive"]},{"name":"Chocolant","location":"Broken Tooth","bug":"Bulldog Ant","snack":"Chocolate Chips","isSelected":false,"strategy":"Chocolant may be found on its own, or in a small form, riding on the back of Cellystix. These Chocolants grow to their normal size if Cellystix is shrunk. Large Chocolants walk along a set path, and when shrunk, they become fearful of the player, running away if they get too close. Scared Chocolants may hide in hollow logs, which they can be flushed out of using the Buggy Ball. If a large Cellystix is nearby, they will try to jump onto its back, and will keep trying even if unsuccessful. A small Chocolant can be caught in any method, including by using the Snak Trap or Trip Shot, or by luring it into the path of an aggressive snak.\n\nA trio of Chocolants will play keep-away with a chocolate- or peanut butter-covered Buggy Ball, each competing to pick it up. They can also be coerced into picking up a trampoline, which can then be bounced on.\n\nSmall Chocolants can be found as obstacles in Buggy Ball mazes around the island. These Chocolants patrol a set path, and will grab the Buggy Ball if they touch it, moving it to another part of the maze. This can help or hinder the player depending on the maze.","calories":"7,000","attributes":["Sweet"]},{"name":"Cinnasnail","location":"Sugarpine Woods","bug":"Snail","snack":"Cinnamon Roll","isSelected":false,"strategy":"Cinnasnail sticks to surfaces out of the player's reach, where it can be caught with a Snak Trap launched by a Lunchpad. Once captured, the trap will stick to the same surface. Though it can sometimes be reached by jumping, the safest option is to retrieve the trap with the Snakgrappler. Cinnasnail can also be lured within reach using chocolate before capture.\n\nCinnasnail have the Sticky attribute but interacting with them does not make one sticky like attacking Hunnabee do. Throwing a basketball or the Buggy Ball on it will have it stick to it for a bit.","calories":"88,000","attributes":["Sweet","Sticky"]},{"name":"Clawbsteroni","location":"Broken Tooth","bug":"Lobster","snack":"Macaroni","isSelected":false,"strategy":"Clawbsteroni is rather simple to catch as it is not aggressive or evasive. It can be shrunk by throwing Shrink Spice on it, under the trampoline it carries or when it is simply free-walking. After this, it can be caught normally using the Snak Trap or Trip Shot. \n\nClawbsteroni's beloved trampoline can be used by the The Journalist to bounce to areas otherwise difficult or impossible to access. It will walk around a set area and hot sauce or cheese can be used to lure it to a different location. Trampolines on the ground mark areas a Clawbsteroni can patrol, and if Clawbsteroni somehow loses its trampoline, it can pick up a new one it encounters.","calories":"144,000","attributes":[]},{"name":"Cobhopper","location":"Garden Grove","bug":"Grasshopper","snack":"Corn Cob","isSelected":false,"strategy":"A single Cobhopper can be seen leaping between four trees in Garden Grove: two in the lower area, and two in the higher area. It rests in a tree for a couple of seconds before quickly leaping to next in no apparent pattern.\n\nTo capture Cobhopper, it must be tripped out of the air using the Trip Shot, stunning it and allowing it to be caught using the Bug Net. There are several ways to do this, one being to trip it between the two trees in the upper area by setting up the Trip Shot on the fence and sticking it high on the rock wall to the left of the entrance of Flavor Falls.","calories":"15,500","attributes":["Evasive"]},{"name":"Greater Cocomite","location":"Boiling Bay","bug":"Mite","snack":"Coconut","isSelected":false,"hasBeenSeen":true,"hasBeenPhotographed":true,"strategy":"When certain trees are hit by either the Snakgrappler or an aggressive Bugsnak, a Cocomite Husk which is a coconut with four closed eyes will fall. This coconut can be picked up and thrown, and if broken with force, will split into a Greater Cocomite and a Lesser Cocomite. Cocomites are aggressive and cannot be trapped, but can be stunned with the Trip Shot, or an attack from another aggressive snak.","calories":"34,400","attributes":["Aggressive"]},{"name":"Lesser Cocomite","location":"Boiling Bay","bug":"Mite","snack":"Coconut","hasBeenSeen":true,"hasBeenPhotographed":true,"isSelected":false,"strategy":"When certain trees are hit by either the Snakgrappler or an aggressive Bugsnak, a Cocomite Husk which is a coconut with four closed eyes will fall. This coconut can be picked up and thrown, and if broken with force, will split into a Greater Cocomite and a Lesser Cocomite. Cocomites are aggressive and cannot be trapped, but can be stunned with the Trip Shot, or an attack from another aggressive snak.","calories":"34,400","attributes":["Aggressive"]},{"name":"Green Crapple","location":"Boiling Bay","bug":"Crab","snack":"Green Apple","isSelected":false,"hasBeenSeen":true,"hasBeenPhotographed":false,"strategy":"Crapples are curious Bugsnax that patrol a set area. If something interests them, they will pick it up and try to carry it back to their underwater lair. For example, a Crapple may pick up a Buggy Ball covered in chocolate or peanut butter, or a full Snak Trap. They will run away if the player approaches, dropping whatever they are carrying.\n\nIf a Crapple successfully brings something back home, it will throw that thing on top of the lair, and then continue walking. If it throws a Bugsnak to its lair, that Snak will be momentarily stunned, and vulnerable to capture in the Bug Net.\n\nCrapples can be caught simply by placing a Snak Trap in their path. ","calories":"8,000","attributes":["Green","Fruity"]},{"name":"Crapple","location":"Simmering Springs","bug":"Crab","snack":"Red Apple","isSelected":false,"strategy":"Crapples are curious Bugsnax that patrol a set area. If something interests them, they will pick it up and try to carry it back to their underwater lair. For example, a Crapple may pick up a Buggy Ball covered in chocolate or peanut butter, or a full Snak Trap. This can be useful for capturing Pineantulas, as a Crapple can dig them out of the sand. They will run away if the player approaches, dropping whatever they are carrying.\n\nCrapples are naturally aggressive to each other, and if two come into contact, one will attack the other, knocking it out and picking it up.\n\nIf a Crapple successfully brings something back home, it will throw that thing on top of the lair, and then continue walking. If it throws a Bugsnak to its lair, that Snak will be momentarily stunned, and vulnerable to capture in the Bug Net.\n\nCrapples can be caught by placing a Snak Trap in their path.","calories":"5,200","attributes":["Red","Fruity"]},{"name":"Daddy Cakelegs","location":"Frosted Peak","bug":"Daddy Longlegs","snack":"Birthday Cake","isSelected":false,"strategy":"Daddy Cakelegs is found in the lower cave, covered in a mound of snow. When approached with Snorpy, a candle will be poking out of this mound, and lighting it will awaken the boss.\n\nThe boss will summon ice pillars from out of the ground. Set the Trip Shot on fire using one of the torches, and shoot it at one of the pillars in the Daddy Cakelegs's path, high enough to light one of the candles on the sides. It is also possible to shoot the flaming Trip Shot directly at the candles, but this is considerably more difficult due to the boss's mobility. Once both candles are lit, Daddy Cakelegs will then burrow into the ground and go to another area on the mountain, its bottom layer splitting into four Baby Cakelegs that will flee to the area where Daddy Cakelegs can be found next. \n\nThis process is repeated for the next phase of the battle, during which Daddy Cakelegs will now sometimes stop to launch a scoop of ice cream that will freeze the player. This attack does grant a somewhat risky opportunity to launch the Trip Shot directly at a candle. \n\nDuring the final phase, Daddy Cakelegs will also gain the ability to climb on the side of the mountain, making it harder to reach. Once its final candle is lit, Daddy Cakelegs will be defeated, and able to be caught with the Bug Net.","calories":"1,344,000","attributes":["Sweet","Aggressive","Frosty","Breakable"]},{"name":"Deviled Eggler","location":"Broken Tooth","bug":"Wasp","snack":"Deviled Eggs","isSelected":false,"strategy":"A Deviled Eggler will not spawn until the Giant Eggler Shell containing it has been cracked in the egg cracker at the center of the crater. There are three Giant Eggler Shells in total:\n\n*one in the crater close to the egg cracker\n*one held by a Spaghider in a tree\n*one in a shrine behind a Buggy Ball maze.\n\nOnce a shell is found, it can be moved by pushing or grappling it. Tikkada Masala will also pick up uncracked shells it encounters, and bring them to the crater. Once a shell is grappled into the egg cracker, it will automatically be cracked, releasing Deviled Eggler. Once a shell is cracked open, it will not need to be opened again on that save file, and the Deviled Eggler will respawn out of its shell.\n\nDeviled Eggler must be shrunk, and have its fire extinguished, in order to capture it. This can be achieved by covering a Millimochi with Hot Sauce, causing Deviled Eggler to be lured to it and neutralize both on contact. Once Deviled Eggler is extinguished, Shrink Spice can easily be thrown at it, and it can then be captured in the Bug Net.","calories":"16,000","attributes":["Aggressive","Flying","Spicy"]},{"name":"Eggler","location":"Sizzlin' Sands","bug":"Slug","snack":"Fried Egg","isSelected":false,"strategy":"Egglers are found encased in hard shells, that must be broken to release the Snak inside. These eggs can be picked up and thrown, but in order to break them, they must be set on fire. This can be achieved by dousing the egg in a sauce loved by Buffalocust, causing it to dive bomb the egg and set it ablaze, though Scorpepper or Picantis can also set it on fire.\n\nOnce the egg breaks, Eggler will flee to the nearest bush to hide in, and can be captured if coaxed out. It can also be instantly captured with the Bug Net if swept up by a Flapjackarak's tornado.","calories":"10,900","attributes":[]},{"name":"Flapjackarak","location":"Sizzlin' Sands","bug":"Wheel Spider","snack":"Bacon and Pancakes","isSelected":false,"strategy":"When Flapjackarak sees the player, it will pursue them, and begin spinning two of its bacon strips to create a tornado above itself. If the player is caught in this tornado, they will be swept upward, but the tornado can also be used to sweep up other Bugsnax, making them vulnerable to capture. This is especially useful against spicy Snax, as it will extinguish their flame as well. After a few seconds, Flapjackarak will become tired, and it can then easily be captured in the Snak Trap.\n\nCan also be caught using the Trip Shot and Bug Net.","calories":"180,000","attributes":["Sweet","Meaty","Aggressive"]},{"name":"Flutterjam","location":"Frosted Peak","bug":"Butterfly/Moth","snack":"Peanut Butter and Jelly Sandwich","isSelected":false,"hasBeenSeen":false,"hasBeenPhotographed":false,"strategy":"Flutterjam is rather easy to catch, with most of the difficulty coming from its somewhat rare appearance. It only appears at the top of Frosted Peak during the day, flying high above the ground. If hit with peanut butter from the Sauce Slinger, it will instantly close its wings together and fall to the ground, happy to have become a peanut butter and jelly sandwich. It can then be captured with the Bug Net.","calories":"26,200","attributes":["Sweet","Flying"]},{"name":"Fryder","location":"Garden Grove","bug":"Spider","snack":"French Fries","isSelected":false,"strategy":"Fryders can be found walking around on the ceiling of the cave underneath Wambus' farm in Garden Grove. When scared, they will freeze in place.\n\nTo capture them, their favorite Sauce Slinger must be used to bait them into coming to the ground, where they can be captured in the Snak Trap.","calories":"36,500"},{"name":"Sweet Fryder","location":"Scorched Gorge","bug":"Spider","snack":"Sweet Potato Fries","isSelected":false,"strategy":"One Sweet Fryder appears at a time in Scorched Gorge, on a cliff across from the central mesa. This cliff is inaccessible to the player, but the Lunchpad can be used to launch a Snak Trap over the canyon to catch the Fryder. The wind will then blow the trap to the ground, where it can be retrieved.","calories":"40,000","attributes":["Sweet"]},{"name":"Green Grapeskeeto","location":"Simmering Springs","bug":"Mosquito","snack":"Raisin/Grape","isSelected":false,"strategy":"Grapeskeetos are unique in that they can be coaxed into feeding upon other Bugsnax. If a nearby Snak is covered in chocolate from the Sauce Slinger, Grapeskeeto will not only slurp the sauce off of it, but suck out some Snakwater from its prey. This will cause the raisin-like Snak to swell into a plump grape and be unable to fly for a few seconds, allowing it to be captured in the Bug Net.","calories":"330","attributes":["Green","Fruity","Aggressive","Flying","Evasive"]},{"name":"Grapeskeeto","location":"Boiling Bay","bug":"Mosquito","snack":"Raisin/Grape","isSelected":false,"hasBeenSeen":true,"hasBeenPhotographed":true,"strategy":"Grapeskeetos are unique in that they can be coaxed into feeding upon other Bugsnax. If a nearby Snak is covered in chocolate from the Sauce Slinger, Grapeskeeto will not only slurp the sauce off of it, but suck out some Snakwater from its prey. This will cause the raisin-like Snak to swell into a plump grape and be unable to fly for a few seconds, allowing it to be captured in the Bug Net.","calories":"370","attributes":["Fruity","Aggressive","Flying","Evasive"]},{"name":"Hunnabee","location":"Sugarpine Woods","bug":"Honeybee","snack":"Honey","isSelected":false,"strategy":"Hunnabees fly together in groups of three. If something is launched at a Hunnabee, such as a Snak Trap, or another Hunnabee flies into it, the Hunnabee will stick to it and fall with it back to the ground, where it can be caught with the Bug Net. Hunnabees can also be angered, by shooting them with the Sauce Slinger, for example. They will then target the player, but will be knocked out if they come into contact with the ground, or even each other. An angry Hunnabee that touches the player will make them sticky, slowing their movement for a short while.","calories":"6,400","attributes":["Sweet","Flying","Sticky"]},{"name":"Incherrito","location":"Sizzlin' Sands","bug":"Inchworm","snack":"Burrito","isSelected":false,"strategy":"Incherritos are found mainly in the under ruins. They burrow through the sand, knocking away the player, as well as any tools nearby. To capture them, one of their favorite Sauce Slinger should be used to lure them onto a solid stone surface. Once Incherrito has emerged and is on this hard surface, approaching it will cause it to attempt to burrow underground, knocking itself out briefly. It can then be caught in the Bug Net.\n\nAn Incherrito will appear after a Preying Picantis has broken apart or in the same area where you can find a Black Razzby.","calories":"44,700","attributes":["Meaty","Aggressive","Burrowing"]},{"name":"Inchwrap","location":"Flavor Falls","bug":"Inchworm","snack":"Lettuce Wrap","isSelected":false,"strategy":"Two Inchwraps can be found crawling in circles around Flavor Falls. One can be found in the cave with roots covering its entrance. The second can be found on the upper part of the area, accessible by the cave behind the waterfall. Inchwrap is burrowed underground when you first see it. It is aggressive, and will go out of its way to run into other Bugsnax (with the exception of Pinkle), the player, and any of the player's deployed tools. Inchwrap can't be affected by any tool while burrowed. Once Inchwrap surfaces, it will quickly scurry around, avoiding the player, and burrow again once enough time has passed.\n\nTo capture Inchwrap, the player must use its favorite sauces to lure it out of the dirt and onto a solid surface, such as a rock. Once Inchwrap is on this surface, approaching it will make it attempt to burrow, and it will knock itself out upon impact. It can then be captured in the Bug Net.","calories":"20,000","attributes":["Green","Aggressive","Burrowing"]},{"name":"Instabug","location":"Frosted Peak","bug":"Ant","snack":"Trendy Sweets","isSelected":false,"strategy":"Like its Shishkabug cousins, Instabugs will hide in bushes around the Frosted Peak. They are unique in requiring the use of the SnaxScope to lure them out of their hiding place.\n\nSet up a Snak Trap near the bush, take out the SnakScope to lure it out, then quickly put it away and trigger the trap before it goes back into hiding.\n\nOr you could just pull the SnaxScope out and instantly put it back to make it walk normally.","calories":"52,400","attributes":["Sweet"]},{"name":"Kweeble","location":"Simmering Springs","bug":"Weevil","snack":"Kiwi","isSelected":false,"strategy":"Kweebles are a bit shy, and will hide when the player gets close. Like other timid snax, it may hide in a bush, but it may also hide in a log or hole, where the Buggy Ball can be used to flush it out. Kweeble's love of chocolate can be used to easily lure it out for capture in the Snak Trap. If the Buggy Ball is covered in chocolate, Kweebles will eagerly follow and play with it.","calories":"4,100","attributes":["Fruity"]},{"name":"Golden Kweeble","location":"Boiling Bay","bug":"Weevil","snack":"Golden Kiwi","isSelected":false,"hasBeenSeen":true,"strategy":"Golden Kweebles are shy, and will hide in a bush when the player gets close. Golden Kweeble's love of chocolate can be used to easily lure it out for capture in the Snak Trap. If the Buggy Ball is covered in chocolate, Golden Kweeble will eagerly follow and play with it.","calories":"4,200","hasBeenPhotographed":true,"attributes":["Fruity"]},{"name":"Kwookie","location":"Sugarpine Woods","bug":"Huntsman Spider","snack":"Sandwich Cookie","isSelected":false,"strategy":"Kwookies run around in circles quickly, and they move so fast they can easily outrun all traps; except the Trip Shot When they get close to you or your traps, they zoom by at quick speeds and emit a taunting icon, as if to say, \"You're too slow!\" By tripping them up with the Trip Shot, they get stunned for a moment, allowing the player to swoop up this cheeky confectionary.\n\nIf a Snak Trap is covered in peanut butter, Kwookie will run into it and bounce off, creating a very brief opportunity to catch it in the trap.","calories":"15,000","attributes":["Sweet","Evasive"]},{"name":"Black Lollive","location":"Sizzlin' Sands","bug":"Long-Tongued Fly","snack":"Black Olive","isSelected":false,"strategy":"One Black Lollive can be seen flying in circles around the oasis. If Black Lollive is near the Snak Trap, it will latch onto the trap with its extendable tongue and carry the trap with it as it flies. Black Lollive will also stick its tongue to other Bugsnax, the Lunchpad, the Buggy Ball, or the Trip Shot if they are covered in cheese, its favorite sauce.\n\nTo capture Black Lollive, it can be tripped out of the sky with the Trip Shot and collected in the Bug Net. It can also be caught in the Snak Trap by launching it at Black Lollive with the Lunchpad, or by having Black Lollive lick up the Snak Trap and waiting for the trap to randomly swing within catching range.","calories":"3,600","attributes":["Flying"]},{"name":"Green Lollive","location":"Flavor Falls","bug":"Long-Tongued Fly","snack":"Green Olive","isSelected":false},{"name":"Mama Mewon","location":"Flavor Falls","bug":"Tick","snack":"Watermelon","isSelected":false,"strategy":"Once the beast is awake, you'll see lots of Wee Mewon bouncing around. What you need to do is lay down your Snak Trap in front of one of the statues. Eventually, a Wee Mewon will wander into it — trigger the trap when this happens. The Mama Mewon will charge right over and slam into the statue. While she's staggered, use the Snak Grappler to pull down the stalactite on top of her\n\nAfter you do this three times, Mama Mewon will transform and start chasing you down. She'll hit you, sending you to a brief cutscene with Chandlo. He says he'll distract the creature while you \"get the drop on her\". Wait for him to distract Mama Mewon. It'll ram him and be stunned once more. Use the Snak Grappler on the stalactite above one last time, and you can then go in for the capture.","calories":"548,400","attributes":["Red","Green","Fruity","Aggressive","Breakable"]},{"name":"Megamaki","location":"Boiling Bay","bug":"Bristle Worm /Sea Serpent","snack":"Sushi (Dragon Roll)","isSelected":false,"hasBeenSeen":false,"strategy":"Megamaki is a very large Bugsnak that consists of ten segments; the Megamaki head, as well as nine Minimaki followers. Due to the size of this Bugsnak and the method required to catch it, it's recommended to have an empty inventory before starting this encounter.\n\nMegamaki is highly aggressive, and will shoot many roe eggs at the player if they get too close. It will swim and fly in a large repeating path throughout the Bay.\n\nThe player must make strategic use of the Trip Shot, using patches of hardened lava on the ground and the giant chopsticks in the bay, in order to stun it. Megamaki's explosive eggs may temporarily destroy these chopsticks, making it more difficult to place the Trip Shot. \n\nOnce Megamaki is stunned, it will break apart into segments. The player then has a limited amount of time to run in and catch as many Minimaki segments with their Bug Net or Snakgrappler as soon as as possible before it reforms. \n\nRepeat the process as long as needed until all of the Minimaki have been collected. Once each segment is gone, the head of Megamaki will be catchable with the net/ snakgrappler.","calories":"952,000","hasBeenPhotographed":false},{"name":"Millimochi","location":"Broken Tooth","bug":"Millipede","snack":"Mochi Ice Cream","isSelected":false,"strategy":"Millimochis travel in single-file groups of three. Upon seeing the player, Millimochi will leap at them in an attempt to freeze them. To catch Millimochi, it must be shrunk using Shrink Spice, and have its ice thawed. This can be done using the flame from an Ancient Flare, or by having it collide with a spicy snak like Tikkada Masala or Deviled Eggler. Millimochi can then be caught using the Bug Net.\n\nBefore the temple is opened, Millimochi will attempt to stop the player from opening it, by leaping into and extinguishing the flare that opens the door. After the temple is accessed, it will no longer attempt to do this.","calories":"10,000","attributes":["Aggressive","Frosty","Sweet"]},{"name":"Minimaki","location":"Boiling Bay","bug":"Bristle Worm /Sea Serpent","snack":"Sushi (Dragon Roll)","hasBeenSeen":false,"isSelected":false,"hasBeenPhotographed":false},{"name":"Mothza Supreme","location":"Sizzlin' Sands","bug":"Moth","snack":"Pizza","isSelected":false,"strategy":"When you get to the altar, place down the Lunchpad in the slot. Mothza must be brought down by hitting it with a launched Bombino. Once on the ground, use the Snakgrappler on the stone slicers to pull them down on Mothza. Mothza will start to create tornados at some point and the player should then shoot the Bombino a little below it into the tornado. The tornado will transport it up to Mothza.\n\nRepeat these steps until Mothza becomes small enough to be captured with the Bug Net.","calories":"1,008,000","attributes":["Meaty","Aggressive","Flying","Breakable"]},{"name":"Noodler","location":"Boiling Bay","bug":"Spider Crab","snack":"Noodle Soup","isSelected":false,"hasBeenSeen":false,"hasBeenPhotographed":false},{"name":"Paletoss","location":"Boiling Bay","bug":"Atlas Beetle","snack":"Paleta","isSelected":false,"hasBeenSeen":true,"hasBeenPhotographed":false},{"name":"Paletoss Grande","location":"Boiling Bay","bug":"Atlas Beetle","snack":"Paleta","hasBeenSeen":false,"hasBeenPhotographed":false,"isSelected":false},{"name":"Pielobite","location":"Broken Tooth","bug":"Trilobite","snack":"Pecan Pie","isSelected":false,"strategy":"Pielobite has a protective cover that deflects Shrink Spice, with four stickers keeping it attached. These stickers can be removed using the Snakgrappler. After each sticker is removed, Pielobite will run away to a different area, and once all four are removed, it will be vulnerable to Shrink Spice. Once shrunk, it can be caught normally with a Snak Trap.","calories":"402,400","attributes":["Evasive","Sweet"]},{"name":"Green Peelbug","location":"Scorched Gorge","bug":"Pillbug","snack":"Lime","isSelected":false,"strategy":"Like all variants of Peelbugs, they can be found hiding in small burrows that the player cannot access. In this case, the Green Peelbug is found two different burrows in the surrounding cliffs.\n\nThe first burrow is nearby to the Snaxburg entrance, where there is a Spuddy patrolling outside. The second burrow is in a secret cave, alongside Shy Weenyworms.\n\nThe Buggy ball can be instructed to roll through the burrow, which will chase the Green Peelbug out of it's den. It will circle around the area it's been forced out of and quickly run back into the burrow. You can easily capture it with the Snak Trap by placing the trap outside the other end of the burrow and capturing it as it leaves.","calories":"2,000","attributes":["Green","Fruity"]},{"name":"Orange Peelbug","location":"Simmering Springs","bug":"Pillbug","snack":"Orange","isSelected":false,"strategy":"Like all variants of Peelbugs, they can be found hiding in small burrows that the player cannot access. In this case, the Orange Peelbug can be found in multiple small burrows on the side of the rock formations, as well as in hollow logs on the shore. The Peelbug tunnel closest to Gramble's camp is marked with a sign.\n\nOnce the Buggy Ball has been obtained, Sprout can be instructed to roll through the burrow, which will chase the Orange Peelbug out of its den. It will circle around the area it's been forced out of and quickly run back into the burrow. You can easily capture it with the Snak Trap by placing the trap outside the other end of the burrow and capturing it as it leaves.","calories":"4,500","attributes":["Fruity"]},{"name":"Ruby Peelbug","location":"Flavor Falls","bug":"Pillbug","snack":"Blood Orange","isSelected":false,"hasBeenSeen":false,"strategy":"Like all variants of Peelbugs, they can be found hiding in small burrows that the player cannot access. In this case, the Ruby Peelbug is found in a burrow going through the cliff that divides the two halves of Flavor Falls.\n\nOnce the Buggy Ball has been obtained, Sprout can be instructed to roll through the burrow, which will chase the Ruby Peelbug out of it's den. It will circle around the area it's been forced out of and quickly run back into the burrow. You can easily capture it with the Snak Trap by placing the trap outside the other end of the burrow and capturing it as it leaves.","calories":"10,400","attributes":["Red","Fruity"],"hasBeenPhotographed":false},{"name":"Yellow Peelbug","location":"Sugarpine Woods","bug":"Pillbug","snack":"Lemon","isSelected":false,"strategy":"Like all variants of Peelbugs, they can be found hiding in small burrows that the player cannot access. In this case, the Yellow Peelbug can be found in two burrows going through the rocky cliffs.\n\nThe first burrow is to the left of the entrance from Snaxburg. The other has entrances on both the first and second level, one in a small valley behind a Big Bopsicle and the other opposite of Snorpy's log cabin.\n\nThe Buggy Ball can be instructed to roll through the burrow, which will chase the Yellow Peelbug out of it's den. It will circle around the area it's been forced out of and quickly run back into the burrow. You can easily capture it with the Snak Trap by placing the trap outside the other end of the burrow and capturing it as it leaves.","calories":"1,700","attributes":["Fruity"],"hasBeenSeen":true,"hasBeenPhotographed":false},{"name":"Pineantula","location":"Simmering Springs","bug":"Tarantula/Trapdoor Spider","snack":"Pineapple","isSelected":false,"strategy":"Pineantula is a rather timid Bugsnak. It spends most of its time burrowing through the sand, with only its top leaves showing. The player cannot directly dig it out, but if the Sauce Slinger is used to cover it in chocolate or peanut butter, any nearby Crapple will take interest, dig it up, and begin to carry it back to its lair. When the player approaches the Crapple, it will flee and drop the Pineantula, which will be in a daze, able to be captured with the Bug Net.\n\nUpon entering Simmering Springs any time after Gramble has left, the Pineantula near Gramble's hammock will immediately bump into a Tropicabug and become dazed for a bit. By running there right after entering the area, this Pineantula can be caught with minimal effort.","calories":"45,200","attributes":["Fruity","Burrowing"]},{"name":"Pinkle","location":"Flavor Falls","bug":"Hermit Crab","snack":"Pickles","isSelected":false,"strategy":"Pinkles will pace along a stretch of river or pond. When the player or another Bugsnak gets too close, Pinkle's pickle legs will recede into their jar shell, where they cannot be captured with the Snak Trap.\n\nTo capture them, you must have obtained the Snakgrappler from Snorpy. You can use the Snakgrappler to pull their jar off, leaving them exposed for you to either collect with the Snakgrappler or collect with the Bug Net. The former is recommended, however, due to them running incredibly quickly when exposed. A jarred Pinkle can also be coated in cheese from the Sauce Slinger, causing a Green Lollive to snatch its jar away.\n\nIf a vulnerable Pinkle encounters an empty jar, it will wear it, even if that jar originally belonged to a different Pinkle. It will also wear an available Aggroll shell.","calories":"2,800","attributes":["Green"]},{"name":"Poptick","location":"Scorched Gorge","bug":"Tick","snack":"Popcorn","isSelected":false,"strategy":"Popticks initially appear as small corn kernels, too small to catch in the Snak Trap. They bounce around erratically, always close to a Scorpenyo. In order to catch Poptick, the player must use the Sauce Slinger to cover it in hot sauce, causing Scorpenyo to shoot a fiery projectile at it. The fire will cause Poptick to pop, becoming puffier, larger, and catchable. As long as Scorpenyo is around, however, a nearby Snak Trap will be quickly burned to bits. Poptick can be lured away from Scorpenyo and into a trap using chocolate- not cheese, as this will cause Scorpenyo to follow as well.","calories":"100","attributes":["Evasive"]},{"name":"Caramel Poptick","location":"Flavor Falls","bug":"Tick","snack":"Caramel Corn","isSelected":false},{"name":"Preying Picantis","location":"Sizzlin' Sands","bug":"Praying Mantis","snack":"Assorted Mexican Food","isSelected":false,"strategy":"Preying Picantis is an aggressive, formidable Snak. Once it notices the player, it will chase them, and contact with this spicy Snak will set the player ablaze. Picantises are found on stone platforms, and if the platform is high enough, it may not care to follow the player off. In this case, the Lunchpad can be used to launch it onto the sand below, where it can be strategically lured.\n\nIn order to capture a Picantis, it must be stunned and extinguished at the same time, allowing it to be caught in the Bug Net. This can be achieved by having it come into contact with a Flapjackarak's whirlwind, where it will be safe to capture upon hitting the ground. Alternatively, Picantis' fire can be doused by Sodie D or by luring it into the oasis, and it can then be stunned using the Trip Shot or by a Loaded Spuddy's attack.\n\nIf a Picantis is extinguished and not stunned in time, it will break apart into its component Bugsnax.","calories":"93,600","attributes":["Meaty","Aggressive","Spicy","Breakable"]},{"name":"Black Razzby","location":"Sizzlin' Sands","bug":"Ladybug","snack":"Black Raspberry/Blackberry","isSelected":false,"strategy":"Black Razzby acts just like Strabby, White Strabby, and Razzby, and much like them, it loves Chocolate Sauce. However, because they only spawn in one place, you don't need to scan them to watch their walking pattern, much like the White Strabby.\n\nCatching them is as easy as you would expect. Place the Snak Trap down, and wait for the right time to activate the trap and catch the Black Razzby.\n\nThe only Black Razzby in the game appears in the underground ruins of Sizzlin' Sands. While very simple to catch, one of Shelda's quests requires the player not to catch it, but to guide it above ground. This requires the careful guidance of a chocolate-covered Buggy Ball.","calories":"430","attributes":["Fruity"]},{"name":"Razzby","location":"Simmering Springs","bug":"Ladybug","snack":"Raspberry","isSelected":false,"strategy":"Razzby behaves identically to Strabby, walking around a small area and running away from the player. It can be caught easily by a Snak Trap placed in its path. Razzbies near Peelbug tunnels can retreat into the tunnels to hide, but will exit on their own once they feel safe.\n\nA single Razzby inhabits Sprout's obstacle course once Gramble returns to Snaxburg. By launching into the obstacle course with the Lunchpad, it is possible to catch this Razzby.","calories":"430","attributes":["Red","Fruity"]},{"name":"Ribblepede","location":"Scorched Gorge","bug":"Centipede","snack":"BBQ Ribs","isSelected":false,"strategy":"Catching Ribblepede is rather simple. It lurks motionlessly on walls, commonly in the buildings at Triffany's digsite. It can be lured down and into range of a Snak Trap by slinging hot sauce on the ground.","calories":"76,200","attributes":["Meaty"]},{"name":"Rootle","location":"Flavor Falls","bug":"Earthworm","snack":"Carrot","isSelected":false,"strategy":"A single Rootle can be seen inching around in a circle in the inner part of Flavor Falls during the night. If the player comes near to Rootle, it will quickly burrow underground to prevent capture, leaving only its backside visible. It emerges from the ground once the player leaves its immediate area. Rootle will also run away from the Buggy Ball, though it will not burrow to hide from it.\n\nIf moved from its original range, Rootle will simply crawl around the new area, making no effort to return.\n\nTo capture Rootle, the player can set the Snak Trap in its path or trip it using the Trip Shot and collect it using the Bug Net.","calories":"2,500","attributes":["Burrowing"]},{"name":"White Rootle","location":"Flavor Falls","bug":"Earthworm","snack":"Parsnip","isSelected":false,"strategy":"A single White Rootle can be seen inching around in a circle in the inner part of Flavor Falls during the day. If the player comes near to White Rootle, it will quickly burrow underground to prevent capture, leaving only its backside visible. It emerges from the ground once the player leaves its immediate area. White Rootle will also run away from the Buggy Ball, though it will not burrow to hide from it.\n\nIf moved from its original range, White Rootle will simply crawl around the new area, making no effort to return.\n\nTo capture White Rootle, the player can set the Snak Trap in its path or trip it using the Trip Shot and collect it using the Bug Net.","calories":"10,000","attributes":["Burrowing"]},{"name":"Sandopede","location":"Flavor Falls","bug":"Centipede","snack":"Submarine Sandwich","isSelected":false,"strategy":"Two Sandopedes can be found sandwiching two Sub Sandopede as the four Bugsnax charge around every area of Flavor Falls aside from the caves. While it won't go out of its way to hit the player, it makes sure to send them flying if the player happens to find themself in Sandopede's path which can make for a nice shortcut to the upper part of Flavor Falls. If Sandopede finds itself off track, whether from a detour to have a taste of cheese or ranch, or from the player launching it with the Lunchpad, Sandopede will swiftly find its way back, undeterred.\n\nTo capture Sandopede, the player must trip it using the Trip Shot, after which Sandopede will break into its four parts ready for collecting. Alternatively, the player can attempt to get an Inchwrap and Sandopede to collide which can lead to the Sandopede being stunned. This is useful if the player wishes to catch Sandopede before obtaining the Trip Shot. \n\nIf any segments of the full Sandopede are captured, the remaining segments will regroup and continue to march around normally.","calories":"31,000","attributes":["Meaty","Aggressive"]},{"name":"Sub Sandopede","location":"Flavor Falls","bug":"Centipede","snack":"Submarine Sandwich","isSelected":false,"strategy":"Two Sub Sandopedes can be found sandwiched by two Sandopede as the four Bugsnax charge around every area of Flavor Falls aside from the caves. While it won't go out of its way to hit the player, it makes sure to send them flying if the player happens to find themself in Sub Sandopede's path which can make for a nice shortcut to the upper part of Flavor Falls. If Sub Sandopede finds itself off track, whether from a detour to have a taste of cheese or ranch, or from the player launching it with the Lunchpad, Sub Sandopede will swiftly find its way back, undeterred.\n\nTo capture Sub Sandopede, the player must trip it using the Trip Shot, after which Sub Sandopede will break into its four parts ready for collecting. Alternatively, the player can attempt to get an Inchwrap and Sub Sandopede to collide which can lead to the Sub Sandopede being stunned. This is useful if the player wishes to catch Sub Sandopede before obtaining the Trip Shot.","calories":"31,000","attributes":["Meaty","Aggressive"]},{"name":"Scoopy","location":"Frosted Peak","bug":"Earthworm","snack":"Neapolitan Ice Cream","isSelected":false,"strategy":"A Scoopy will spawn upon breaking a Scoopy Banoopy, and will proceed to burrow around the rock outside the lower cave. If approached, Scoopy will attack by flinging scoops of ice cream, which will freeze the player on contact. If it is on solid ground, however, it will flee in fear until it can burrow again. In order to catch Scoopy, its frosty armor must be thawed. This can be done by having it come into contact with a flaming Trip Shot, a campfire, or a Stewdler. Scoopy can then be caught in the Bug Net.","calories":"83,800","attributes":["Sweet","Aggressive","Burrowing","Frosty"]},{"name":"Scoopy Banoopy","location":"Frosted Peak","bug":"Giant Water Bug","snack":"Banana Split","isSelected":false,"strategy":"Scoopy Banoopy is aggressive, and will chase the player if it sees them. When it tackles the player, it will launch them into the air and freeze them. It seems to have a rather short attention span, however, and will quickly turn around and begin to leave if the player gets slightly too far away.\n\nTo catch Scoopy Banoopy without breaking it, the player must first thaw it by leading it into something such as fire or a Stewdler, then stun it by using the Trip Shot before the timer runs out. If successful, the player will then be able to use their net to catch it.\n\nIf Scoopy Banoopy walks into a flaming Trip Shot, it will instantly be thawed and stunned at the same time, allowing it to be captured.","calories":"112,500","attributes":["Fruity","Sweet","Aggressive","Frosty","Breakable"]},{"name":"Scorpenyo","location":"Scorched Gorge","bug":"Scorpion","snack":"Jalapeño Pepper","isSelected":false,"strategy":"Scorpenyos are constantly on fire, and upon sight of the player, any of their tools, or Hot Sauce, they will lob fireballs in their direction, setting them and nearby Popticks ablaze, causing the latter to pop into their puffier, catchable forms. Their fireballs are also the only way to poof up and catch Popticks.\n\nTo catch a Scorpenyo, one must have the Cheese Sauce on their Sauce Slinger. They must shoot the cheese close to the small puddle under the bridge to lure it into the puddle and douse the flames on its body. From there they can swoop it up in their Bug Net.\n\nScorpenyo is catchable without using cheese, though it is considerably more difficult, and possible for both Scorpenyos. The Scorpenyo under the bridge can be captured in a Snak Trap launched by the Lunchpad, and though this will set the trap on fire, it will be doused upon landing in the water. It should also be noted that the Lunchpad's trajectory can be misleading in this location, as launched objects can hit the bottom of the bridge and fall, instead of flying in an arc to the apparent target. Alternatively, the player can shoot Hot Sauce at or near the Scorpenyo which can cause it to fall off the wall and land in the river, extinguishing it and allowing it to be caught. The Scorpenyo near the path to Snaxburg can be caught by placing a Lunchpad on the ground below it, launching a Trap Shot next to the Scorpenyo and having it fall onto the Lunchpad. It can then be launched into the water from here, although you have to be fast so the Lunchpad doesn't burn completely. Afterwards, the Scorpenyo can be collected from the stream. Note that this method may take many tries.","calories":"2,600","attributes":["Green","Aggressive","Spicy"]},{"name":"Scorpepper","location":"Sizzlin' Sands","bug":"Scorpion","snack":"Ghost Pepper","isSelected":false,"strategy":"Scorpepper lurks on the wall of the large structure that houses the Sauce plant, invisible until disturbed. It is constantly ablaze, and will lob fireballs at the player, their traps, and hot sauce. To capture it, its flame must be extinguished. This can be done by luring it to the oasis using cheese, where Sodie D will extinguish it, or by luring Sodie D to Scorpepper using a trail of any sauces. During the daytime, Flapjackarak can be used to stun Scorpepper, as its whirlwind attack can reach it, put out its fire, and knock it to the ground. Scorpepper can then be caught in the Bug Net.","calories":"1,500","attributes":["Red","Aggressive","Spicy"]},{"name":"Sherbie","location":"Boiling Bay","bug":"Earthworm","snack":"Rainbow Sherbet","hasBeenSeen":true,"hasBeenPhotographed":true,"isSelected":true,"strategy":"Sherbie can be found burrowing in the sand around a patch of grass, at the furthest point of Boiling Bay. If approached while burrowing, Sherbie will attack by flinging scoops of sherbet, which will freeze the player on contact. If it is on solid ground, however, it will flee in fear until it can burrow again. In order to catch Sherbie, its frosty armor must be thawed. This can be done by having it come into contact with a flaming Trip Shot, or the nearby lava flow. Sherbie can then be caught in the Bug Net.","calories":"54,000","attributes":["Sweet","Aggressive","Burrowing","Frosty"]},{"name":"Shishkabug","location":"Garden Grove","bug":"Ant","snack":"Shish Kebab","isSelected":false,"strategy":"Shishkabugs are extremely shy, and if they spot the player they will hide in a Hiding Bush and refuse to come out. To get them out of the bush, the Sauce Slinger and Ketchup can be used to lure a Bunger into charging at the bush. \n\nOnce out in the open, the Shishkabug will run for a different Hiding Bush. To capture them, set up a Snak Trap between the bushes and capture them as they run for the next bush.\n\nBefore spotting the player, they will patrol in a small circle near the Hiding Bushes.","calories":"25,200","attributes":["Meaty"]},{"name":"Crispy Snakpod","location":"Garden Grove","bug":"Bagworm","snack":"Bag of Potato Chips","isSelected":false,"strategy":"Five Crispy Snakpods can be found hidden around Garden Grove. Though some may be difficult to locate, they are very easy to capture when found, and can be captured using the Bug Net, Snakgrappler, or Snak Trap. \n\nSnakpods will not respawn until all five in the area are collected.","calories":"45,900","attributes":[]},{"name":"Fruity Snakpod","location":"Boiling Bay","bug":"Bagworm","snack":"Bag of Candied Fruit","hasBeenSeen":true,"isSelected":false,"strategy":"Five Fruity Snakpods can be found hidden around Boiling Bay. Though some may be difficult to locate, they are very easy to capture when found, and can be captured using the Bug Net, Snakgrappler, or Snak Trap.\n\nSnakpods will not respawn until all five in the area are collected.","calories":"44,100","hasBeenPhotographed":true,"attributes":["Fruity"]},{"name":"Grumpy Snakpod","location":"Simmering Springs","bug":"Bagworm","snack":"Bag of Gummy Candy","isSelected":false,"strategy":"Five Grumpy Snakpods can be found hidden around Simmering Springs. Though some may be difficult to locate, they are very easy to capture when found, and can be captured using the Bug Net, Snakgrappler, or Snak Trap.\n\nSnakpods will not respawn until all five in the area are collected.","calories":"42,000","attributes":["Sweet"]},{"name":"Meaty Snakpod","location":"Sizzlin' Sands","bug":"Bagworm","snack":"Bag of Jerky","isSelected":false,"strategy":"Five Meaty Snakpods can be found hidden around Sizzlin' Sands. Though some may be difficult to locate, they are very easy to capture when found, and can be captured using the Bug Net, Snakgrappler, or Snak Trap.\n\nSnakpods will not respawn until all five in the area are collected.","calories":"41,000","attributes":["Meaty"]},{"name":"Melty Snakpod","location":"Frosted Peak","bug":"Bagworm","snack":"Bag of Chocolate Candy","isSelected":false,"strategy":"Five Melty Snakpods can be found hidden around Frosted Peak. Though some may be difficult to locate, they are very easy to capture when found, and can be captured using the Bug Net, Snakgrappler, or Snak Trap.\n\nSnakpods will not respawn until all five in the area are collected.","calories":"47,900","attributes":["Sweet"]},{"name":"Nutty Snakpod","location":"Sugarpine Woods","bug":"Bagworm","snack":"Bag of Trailmix","isSelected":false,"strategy":"Five Nutty Snakpods can be found hidden around Sugarpine Woods. Though some may be difficult to locate, they are very easy to capture when found, and can be captured using the Bug Net, Snakgrappler, or Snak Trap.\n\nSnakpods will not respawn until all five in the area are collected.","calories":"69,300","attributes":[]},{"name":"Puffy Snakpod","location":"Scorched Gorge","bug":"Bagworm","snack":"Bag of Rice Crackers","isSelected":false,"strategy":"Five Puffy Snakpods can be found hidden around Scorched Gorge. Though some may be difficult to locate, they are very easy to capture when found, and can be captured using the Bug Net, Snakgrappler, or Snak Trap.\n\nSnakpods will not respawn until all five in the area are collected.","calories":"50,400","attributes":[]},{"name":"Twisty Snakpod","location":"Flavor Falls","bug":"Bagworm","snack":"Bag of Pretzels","isSelected":false,"hasBeenSeen":false,"hasBeenPhotographed":false,"strategy":"Five Twisty Snakpods can be found hidden around Flavor Falls. Though some may be difficult to locate, they are very easy to capture when found, and can be captured using the Bug Net, Snakgrappler, or Snak Trap.\n\nSnakpods will not respawn until all five in the area are collected.","calories":"38,000"},{"name":"Snaquiri","location":"Simmering Springs","bug":"Jellyfish/Woolly Aphid","snack":"Daiquiri","isSelected":false,"strategy":"Snaquiri can be found in the ocean, or in a small rock pool close to where the Orange Peelbug sign is. They leap out of the water, then pop out their umbrella and float for a bit, and then drop back down into the water.\n\nOne method to catch it is to use the Trip Shot to trip it out of the air. Another method is to coat it in Sauce while it is in the air to drop it down and stun it.","calories":"11,100","attributes":["Sweet","Burrowing","Flying"]},{"name":"Dr Sodie","location":"Garden Grove","bug":"Shrimp","snack":"Soda (Dr. Pepper)","isSelected":false,"strategy":"A single Dr Sodie can be seen swimming around in the main area of Garden Grove. It makes a loop around the area's pond before moving to the waterfall where it makes a hairpin turn back again. Whenever Dr Sodie sees sauce slung from the Sauce Slinger either on the ground or another Bugsnak, it stops in its tracks to spray it and remove the offending sauce.\n\nDr Sodie can be caught by catching it in the Snak Trap. It can also be caught with the Bug Net if the player lures a charging Bunger into Dr Sodie.","calories":"15,000","attributes":["Sweet"]},{"name":"Sodie D","location":"Sizzlin' Sands","bug":"Shrimp","snack":"Soda/Juice (Sunny D)","isSelected":false,"strategy":"A single Sodie D can be seen swimming around in the oasis area of Sizzlin' Sands.It makes a loop around the area's pond. Whenever Sodie D sees sauce slung from the Sauce Slinger either on the ground or another Bugsnak, it stops in its tracks to spray it and remove the offending sauce. Sodie D can be caught by catching it in the Snak Trap. It can also be caught with the Bug Net if the player lures a charging Loaded Spuddy or Preying Picantis into Sodie D.","calories":"8,000","attributes":["Sweet"]},{"name":"La Sodieux","location":"Boiling Bay","bug":"Shrimp","snack":"Soda/Sparkling Water (La Croix)","hasBeenSeen":false,"hasBeenPhotographed":false,"isSelected":false,"strategy":"La Sodieux can be seen swimming around in the Boiling Bay. It makes a loop around the sea near the bay or the peninsulas. Whenever La Sodieux sees sauce slung from the Sauce Slinger either on the ground or another Bugsnak, it stops in its tracks to spray it and remove the offending sauce. La Sodieux can be caught by catching it in the Snak Trap. It can also be caught with the Bug Net if the player lures a charging Paletoss Grande, Lesser Cocomite, or Greater Cocomite into La Sodieux.","calories":"0","attributes":[]},{"name":"Mt Sodie","location":"Frosted Peak","bug":"Shrimp","snack":"Soda (Mountain Dew)","isSelected":false,"strategy":"A single Mt Sodie can be seen swimming in loops around an icy pond near the entrance to Frosted Peak. Whenever Mt Sodie sees sauce slung from the Sauce Slinger either on the ground or another Bugsnak, it stops in its tracks to spray it and remove the offending sauce.\n\nMt Sodie can be caught by catching it in the Snak Trap. However, the pool it swims in is so cold that a Snak Trap will soon freeze and break if placed in it, so the trap should first be placed on land, and the Sodie lured out to it. It can also be caught with the Bug Net if the player lures a charging Scoopy Banoopy into Mt Sodie or lays down a Trip Shot in Mt Sodie's path.","calories":"17,000","attributes":["Green","Sweet"]},{"name":"Spaghider","location":"Broken Tooth","bug":"Spider","snack":"Spaghetti & Meatballs","isSelected":false,"strategy":"Spaghider is found among the branches of trees. When it takes an interest in something, such as a Snak Trap or Trip Shot or anything covered in cheese, it will use a noodle to grapple it toward itself. A jar of Shrink Spice can be coated in cheese to get Spaghider to grab it and shrink itself. Alternatively, the jar can be launched toward Spaghider using the Lunchpad. You can also cover a Deviled Eggler or a Tikkada Massala in Cheese to get the Spaghider to grapple it, then putting its fire out with a Millimochi Once shrunk, Spaghider can be caught by launching a Snak Trap at it or stunned with the Trip Shot and grabbed with the Snakgrappler.\n\nThere are two Spaghiders present; one in the jungle area with Millimochi and another at the ruins roof with the Cellystix. The latter Spaghider holds onto a Deviled Eggler shell, which can be grappled out of its grasp and quickly moved further from its grasp as the Spaghider will just pick it back up otherwise.","calories":"40,000","attributes":["Aggressive","Meaty"]},{"name":"Sprinklepede","location":"Sugarpine Woods","bug":"Millipede","snack":"Donut","isSelected":false,"strategy":"A single Sprinklepede can be found high on the side of Bugwatch Tower. If hit with the Snakgrappler, Sprinklepede will jump down and begin rolling around the woods at high speeds. It first makes a sharp turn through the stone arch near the cabin, then rolls past and around the cabin, through the lower woods, bounces off the stationary Lunchpad, and returns to its place on the tower.\n\nSprinklepede is too fast to be caught in a Snak Trap while rolling. Once its path is known, however, it can be easily stunned by placing the Trip Shot in its way. The easiest option is to place it in the stone arch, as it is one of Sprinklepede's first destinations.\n\nWhile it is too fast on the ground, Sprinklepede can be caught in the Snak Trap while in the air after bouncing on the Lunchpad.","calories":"29,000","attributes":["Sweet"]},{"name":"Spuddy","location":"Scorched Gorge","bug":"Stag Beetle","snack":"Baked Potato","isSelected":false,"strategy":"Spuddy is highly aggressive, and upon seeing the player, will make a sound like a steaming tea kettle before charging in their direction. If hit by Spuddy's attack, the player will be knocked back. Spuddy's charging can be used to the player's advantage by baiting it to charge in a certain direction and jumping over it, causing it to hit whatever is behind the player. In this manner, Spuddy can knock out Snax such as other Spuddies, as well as BBQ Bunger, allowing them to be caught with the Bug Net. It can also destroy fragile walls, revealing hidden areas.","calories":"16,100","attributes":["Aggressive"]},{"name":"Loaded Spuddy","location":"Sizzlin' Sands","bug":"Stag Beetle","snack":"Loaded Baked Sweet Potato","isSelected":false,"strategy":"Loaded Spuddy is highly aggressive, and upon seeing the player, will make a sound like a steaming tea kettle before charging in their direction. If hit by Loaded Spuddy's attack, the player will be knocked back. Loaded Spuddy's charging can be used to the player's advantage by baiting it to charge in a certain direction and jumping over it, causing it to hit whatever is behind the player. In this manner, Spuddy can knock out Snax such as other Loaded Spuddies, allowing them to be caught with the Bug Net. Alternatively, Loaded Spuddies typically charge into each other in the wild, due to their aggressive nature.","calories":"10,300","attributes":["Sweet","Aggressive"]},{"name":"Strabby","location":"Flavor Falls","bug":"Ladybug/Aphid","snack":"Strawberry","isSelected":false,"strategy":"When undisturbed, Strabbies walk around in small ovals nearby to Hiding Bushes. If you walk too close, they will get scared and retreat in a bush.\n\nTo capture Strabbies, place the Snak Trap near where it is pacing, then back away and wait for it to come out of hiding. If the Trap is placed correctly, it will walk into the Snak Trap capture zone.","calories":"400","attributes":["Red","Fruity"]},{"name":"White Strabby","location":"Garden Grove","bug":"Ladybug/Aphid","snack":"Pineberry","isSelected":false,"strategy":"White Strabbies act identically to red ones. When undisturbed, they walk around in small ovals near Hiding Bushes. If you walk too close, they will retreat into the bush and appear scared.\n\nTo capture White Strabbies, place the Snak Trap near where it is pacing, then back away and wait for it to come out of hiding. If the Trap is placed correctly, it will walk into the Snak Trap capture zone.","calories":"400","attributes":["Fruity"]},{"name":"Stewdler","location":"Frosted Peak","bug":"Spider Crab","snack":"Stew","isSelected":false,"strategy":"Stewdlers inhabit the two caves of Frosted Peak, walking around in circles. To catch them, their flame must be extinguished. This can be done by covering them with chocolate from the Sauce Slinger, enticing a nearby Chillynilly to descend, or by luring another frosty Snak such as Scoopy or Scoopy Banoopy to it. Stewdler can also be doused by Mt Sodie. Once its flame is out, Stewdler can be caught in the Bug Net.\n\nLike Crapple Green Crapple Noodler, Stewdler is curious and playful, and will pick up and throw the Buggy Ball if it gets close enough.","calories":"31,300","attributes":["Red","Meaty","Aggressive","Spicy"]},{"name":"Sweetiefly","location":"Garden Grove","bug":"Dragonfly","snack":"Spherical Lollipop","isSelected":false,"strategy":"Three Sweetieflies can be seen flying around the main area of Garden Grove. They all fly around in a triangle pattern and periodically go to rest on a nearby tree or rock. While they are awake Sweetieflies will avoid the player as well as the Snak Trap, quickly flying away as soon as one or the other comes close to it. \n\nTo capture Sweetiefly, it must be caught in a Snak Trap while resting, either by setting down the trap next to the Sweetiefly that rests on the rock wall, or by launching the trap at it with the Lunchpad. Another method is using the Trip Shot by having the wire cross the Sweetiefly's path.","calories":"2,600","attributes":["Sweet","Flying"]},{"name":"Crystal Sweetiefly","location":"Scorched Gorge","bug":"Dragonfly","snack":"Rock Candy","isSelected":false,"strategy":"Crystal Sweetieflies zip around happily, making them hard targets in motion, but after a moment they slow down onto a surface to rest, making them easier to catch. Many of them are high above reach, requiring skillful use of the Snak Trap and Lunchpad.","calories":"11,000","attributes":["Sweet","Flying"]},{"name":"Lovely Sweetiefly","location":"Simmering Springs","bug":"Dragonfly","snack":"Heart Lollipop","isSelected":false,"strategy":"Lovely Sweetieflies zip around happily, making them hard targets in motion, but after a moment they slow down onto a surface to rest, making them easier to catch. Many of them are high above reach, requiring skillful use of the Snak Trap and Lunchpad.","calories":"12,500","attributes":["Sweet","Flying"]},{"name":"Rainbow Sweetiefly","location":"Sugarpine Woods","bug":"Dragonfly","snack":"Swirled Lollipop","isSelected":false,"strategy":"Rainbow Sweetieflies zip around happily, making them hard targets in motion, but after a moment they slow down onto a surface to rest, making them easier to catch. Some of them are out of reach, requiring skillful use of the Snak Trap, Lunchpad, and Snakgrappler.","calories":"13,000","attributes":["Sweet","Flying"]},{"name":"Tacroach","location":"Sizzlin' Sands","bug":"Cockroach","snack":"Taco","isSelected":false,"strategy":"Two Tacroaches will spawn upon breaking a Preying Picantis. They are timid creatures and will run from the player, but are easily swayed by their favorite sauces, which can be used to lure them right into a Snak Trap.","calories":"16,980","attributes":["Meaty"]},{"name":"Baja Tacroach","location":"Simmering Springs","bug":"Cockroach","snack":"Fish Taco","isSelected":false,"strategy":"Baja Tacroaches will appear on the cliff with Wiggle's chair at night. They are timid and will run from the player, but their favorite sauces can be used to lure them into a Snak Trap without much trouble. Since multiple appear in a small area, it is easy to catch more than one in a single trap.","calories":"27,000","attributes":["Meaty"]},{"name":"Tikkada Masala","location":"Broken Tooth","bug":"Cicada","snack":"Tikka Masala","isSelected":false,"strategy":"Tikkada Masala flies in a set path around Broken Tooth, circling in and out of the central crater. It will bring eggs it finds to its nest, allowing the player to crack them more easily. While in the crater, it can be lured down to the water with hot sauce from the Sauce Slinger, causing its fire to be extinguished. When both its fire is out and it is shrunk by Shrink Spice, Tikkada can be captured with the Bug Net.","calories":"124,900","attributes":["Aggressive","Flying","Meaty","Red","Spicy"]},{"name":"Tropicabug","location":"Simmering Springs","bug":"Ant","snack":"Shish Kebab","isSelected":false,"strategy":"Tropicabugs are extremely shy, and if they spot the player they will hide in a Hiding Bush and refuse to come out. To get them out of the bush, the Sauce Slinger and Chocolate or Peanut Butter can be used to lure a Crapple into charging at the bush.\n\nOnce out in the open, the Tropicabug will run for a different Hiding Bush. To capture them, set up a Snak Trap between the bushes and capture them as they run for the next bush.\n\nThe Lunchpad can also be used to catch a Tropicabug from afar, before it even sees the player.\n\nBefore spotting the player, they will patrol in a small circle near the Hiding Bushes.","calories":"20,500","attributes":["Fruity"]},{"name":"Waffstackarak","location":"Simmering Springs","bug":"Wheel Spider","snack":"Sausages and Waffles","isSelected":false,"strategy":"In order to summon Waffstackarak, the player must ring the dinnerbell located near Wiggle's chair, specifically in the morning. This will cause two Waffstackaraks to emerge from the sea. When Waffstackarak sees the player, it will pursue them, and begin spinning two of its sausage links to create a tornado above itself. If the player is caught in this tornado, they will be swept upward, but the tornado can also be used to sweep up other Bugsnax, making them vulnerable to capture. After a few seconds, Waffstackarak will become tired, and it can then easily be captured in the Snak Trap. It can also be stunned using the Trip Shot.\n\nWaffstackarak fears Crapple, which is capable of picking it up even while it is using its whirlwind attack. Crapple will throw Waffstackarak back to its lair, where it can be caught in the Bug Net.\n","calories":"187,800","attributes":["Sweet","Meaty","Aggressive"]},{"name":"Wee Mewon","location":"Flavor Falls","bug":"Tick","snack":"Watermelon Ball","isSelected":false,"strategy":"Wee Mewons are playful and curious, and unlike other Bugsnax, are fascinated by the Snak Trap. They will gleefully bounce into an open trap, and it is common for many to jump into the same trap, allowing them all to be caught at once. Trapping Wee Mewons is crucial for defeating Mama Mewon, as the mean mama will become enraged and charge if any Wee Mewons are trapped.\n\nAfter Mama Mewon is captured, eight Wee Mewons will later appear in a circle in the middle of the boss arena, scared and petrified without their mama's protection. A single Snak Trap can catch nearly all of them at once. If any escape from a Snak Trap, they will return to their bouncy behavior.","calories":"5,700","attributes":["Red","Fruity"]},{"name":"Weenyworm","location":"Garden Grove","bug":"Earthworm","snack":"Hot Dog","isSelected":false,"strategy":"A single Weenyworm can be found circling a pen in Wambus' former ketchup farm. If the player gets too close to it, it will quickly wriggle away in the opposite direction it was heading, still sticking to its circular path.\n\nIt can easily be captured by placing a Snak Trap in its path, and either backing away or baiting it with Ketchup or Cheese sauce.","calories":"15,100","attributes":["Meaty"]},{"name":"Shy Weenyworm","location":"Scorched Gorge","bug":"Earthworm","snack":"Chicago-Style Hot Dog","isSelected":false,"strategy":"Shy Weenyworms can only be found in the hidden burial chamber, accessed by getting a Spuddy to destroy a cracked wall. Two Shy Weenyworms lurk within, squirming slowly along small round paths. They can be captured simply by putting a Snak Trap in their path and waiting for them to enter its range. Though they like cheese sauce, they do not actively seek it out, so it is not useful for luring them. \n\nThe easiest and fastest way to catch Shy Weenyworm is to weaponize their hatred of ketchup. If one is covered in ketchup, the other will instantly dash into it and knock it out, making it vulnerable to capture in the Bug Net. \n\nShy Weenyworm can also be lured with ketchup, but this is more difficult: these Weenyworms hate ketchup, and while they will chase down a ketchup-covered trap, they will attack it and send it flying. If using ketchup as bait, the player must be fast, and close the trap after Shy Weenyworm has entered its range, but before it can knock it away.\n\nShy Weenyworm can also be captured by getting a Spuddy to charge into it, allowing it to be caught in the Bug Net.","calories":"15,900","attributes":["Meaty"]}]
